<template>
  <el-form>
    <el-row>
      <h3>2023-12-13</h3>
      <p>1. 统一表单控件样式</p>
    </el-row>
    <el-row>
      <h3>2023-12-09</h3>
      <p>1. 单据页面：移除生成发货单的按钮和功能</p>
      <p>2. 流水页面：增加选择流水记录生成发货单的功能</p>
    </el-row>
    <el-row>
      <h3>2023-12-02</h3>
      <p>1. 验收入库：弹窗表格样式微调</p>
      <p>2. 货品出库：支持生产日期字段，批号、有效期可修改</p>
      <p>3. 货品页面：查看库存支持生产日期字段</p>
      <p>4. 单据页面：支持生产日期字段，修改单据时可编辑制单日期、交易公司</p>
    </el-row>
    <el-row>
      <h3>2023-11-30</h3>
      <p>1. 验收入库：表单新增生产日期字段</p>
      <p>2. 流水页面：表格新增生产日期字段</p>
    </el-row>
    <el-row>
      <h3>2023-11-16</h3>
      <p>1. 货品页面：新增扩展字段医保编码、挂网价，新增表格列控制功能</p>
    </el-row>
    <el-row>
      <h3>2023-11-14</h3>
      <p>1. 采购验收：删除灭菌批号，新增生产日期</p>
    </el-row>
    <el-row>
      <h3>2023-11-08</h3>
      <p>1. 公司页面：优化文案</p>
      <p>2. 货品页面：优化文案，增加规格搜索，增加注册号，库存展示增加过期时间</p>
    </el-row>
    <el-row>
      <h3>2023-10-23</h3>
      <p>1. 货品出库页：优化出库时选择库存的体验，隐藏出库时货品的价格</p>
    </el-row>
    <el-row>
      <h3>2023-07-26</h3>
      <p>1. 货品列表页：新增复制功能，支持基于已有货品信息复制添加新货品</p>
    </el-row>
    <el-row>
      <h3>2023-05-30</h3>
      <p>1. 单据列表页：入库单据查看详情时支持查看销售商的发货单（后台仅支持部分销售商） #37</p>
      <p>2. 取消采购计划的菜单入口，调整验收记录的菜单顺序</p>
      <p>3. 验收记录页：新增验收入库的按钮（原先只能通过菜单入口进入）</p>
    </el-row>
    <el-row>
      <h3>2023-04-15</h3>
      <p>1. 货品出库页：取消货品数量限制（增加库存提示）、过期时间允许为空、增强数据库事务控制 #34</p>
    </el-row>
    <el-row>
      <h3>2023-03-29</h3>
      <p>1. 货品流水页：新增额外的显示列多选框，支持显示和隐藏有效期、单位、单价、总价、操作时间等列 #32</p>
    </el-row>
    <el-row>
      <h3>2023-03-25</h3>
      <p>1. 统一“生产批次”为“生产批号”</p>
    </el-row>
    <el-row>
      <h3>2023-03-22</h3>
      <p>1. 货品流水页：新增搜索、公司过滤、表格加载状态 #28</p>
      <p>2. 验收记录页：新增搜索栏、表格加载状态 #29</p>
    </el-row>
    <el-row>
      <h3>2023-03-17</h3>
      <p>1. 修复出入库制单时，删除单行记录异常的问题。</p>
      <p>2. 修复增加验收记录时，修改价格未生效的问题。</p>
    </el-row>
    <el-row>
      <h3>2023-03-14</h3>
      <p>1. 移除常规入库的入口。</p>
      <p>2. 优化验收入库表单，部分输入框改下拉框，移除写死的日期。</p>
    </el-row>
    <el-row>
      <h3>2022-03-27</h3>
      <p>1. 新增了更新日志，用于描述每次发布修改的功能</p>
      <p>2. 修复了货品入库时选择不了最新货品的问题。修改了货品入库时选择商品的逻辑，现在需要先选择生产商，再选择对应的货品。</p>
      <p>3. 修复了货品入库时货品单价没有显示且无法修改的问题。</p>
      <p>4. 新增了修改单据的功能，创建时间在24小时之内的单据可以修改。</p>
    </el-row>
  </el-form>
</template>

<script>
export default {
  name: "Changes.vue"
}
</script>

<style scoped>

</style>
