<template>
  <el-form>
    <el-row>
      <h3>2023-03-17</h3>
      <p>1. 修复出入库制单时，删除单行记录异常的问题。</p>
      <p>2. 修复增加验收记录时，修改价格未生效的问题。</p>
    </el-row>
    <el-row>
      <h3>2023-03-14</h3>
      <p>1. 移除常规入库的入口。</p>
      <p>2. 优化验收入库表单，部分输入框改下拉框，移除写死的日期。</p>
    </el-row>
    <el-row>
      <h3>2022-03-27</h3>
      <p>1. 新增了更新日志，用于描述每次发布修改的功能</p>
      <p>2. 修复了货品入库时选择不了最新货品的问题。修改了货品入库时选择商品的逻辑，现在需要先选择生产商，再选择对应的货品。</p>
      <p>3. 修复了货品入库时货品单价没有显示且无法修改的问题。</p>
      <p>4. 新增了修改单据的功能，创建时间在24小时之内的单据可以修改。</p>
    </el-row>
  </el-form>
</template>

<script>
export default {
  name: "Changes.vue"
}
</script>

<style scoped>

</style>
